# 1번
결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 

그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라

In [1]:
import pandas as pd
data1 = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
data1.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [8]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20317 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          19690 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20406 non-null  float64
 8   median_house_value  20596 non-null  float64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.6+ MB

In [3]:
data1.isnull().sum()

longitude               0
latitude                0
housing_median_age    323
total_rooms             0
total_bedrooms        207
population            950
households              0
median_income         234
median_house_value     44
ocean_proximity         0
dtype: int64

In [13]:
data1 = data1.dropna()

In [17]:
data1 = data1.iloc[:int(len(data1)*0.7)]

In [20]:
round(data1.median_income.quantile(0.25), 2)

2.51

# 2번
1990년대에는 해당년도 평균 이하 GDP를 가지지만, 2010년대에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라

In [21]:
import pandas as pd
data2 = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
data2.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

In [39]:
dt1 = data2[(data2['Year'] < 2000) & (data2['Year'] >= 1990) & (data2['Value'] <= data2['Value'].mean())]
dt2 = data2[(data2['Year'] >= 2010) & (data2['Value'] >= data2['Value'].mean())]
dt1

      Country Name Country Code  Year       Value
22      Arab World          ARB  1990  44687716.2
23      Arab World          ARB  1991  43977917.8
24      Arab World          ARB  1992  47116351.5
25      Arab World          ARB  1993  47651363.1
26      Arab World          ARB  1994  48752690.6
...            ...          ...   ...         ...
11485     Zimbabwe          ZWE  1995    711127.1
11486     Zimbabwe          ZWE  1996    855314.7
11487     Zimbabwe          ZWE  1997    852957.2
11488     Zimbabwe          ZWE  1998    640196.8
11489     Zimbabwe          ZWE  1999    685801.3

[2042 rows x 4 columns]

In [34]:
dt1['Country Code'].unique()

array(['ARB', 'CSS', 'CEB', 'EAP', 'TEA', 'ECA', 'TEC', 'HPC', 'IDB',
       'IDX', 'IDA', 'LDC', 'LIC', 'LMC', 'MEA', 'MNA', 'TMN', 'OSS',
       'PSS', 'PRE', 'SST', 'SAS', 'TSA', 'SSF', 'SSA', 'TSS', 'ALB',
       'DZA', 'AND', 'AGO', 'ATG', 'ARG', 'ARM', 'ABW', 'AUS', 'AUT',
       'AZE', 'BHS', 'BHR', 'BGD', 'BRB', 'BLR', 'BEL', 'BLZ', 'BEN',
       'BMU', 'BTN', 'BOL', 'BIH', 'BWA', 'BRA', 'BRN', 'BGR', 'BFA',
       'BDI', 'CPV', 'KHM', 'CMR', 'CAN', 'CYM', 'CAF', 'TCD', 'CHI',
       'CHL', 'CHN', 'COL', 'COM', 'COD', 'COG', 'CRI', 'CIV', 'HRV',
       'CUB', 'CYP', 'CZE', 'DNK', 'DJI', 'DMA', 'DOM', 'ECU', 'EGY',
       'SLV', 'GNQ', 'ERI', 'EST', 'ETH', 'FRO', 'FJI', 'FIN', 'PYF',
       'GAB', 'GMB', 'GEO', 'GHA', 'GRC', 'GRL', 'GRD', 'GTM', 'GIN',
       'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'HUN', 'ISL', 'IND', 'IDN',
       'IRN', 'IRQ', 'IRL', 'IMN', 'ISR', 'JAM', 'JOR', 'KAZ', 'KEN',
       'KIR', 'KOR', 'KWT', 'KGZ', 'LAO', 'LVA', 'LBN', 'LSO', 'LBR',
       'LBY', 'LIE', 'LTU', 'LUX', 'MAC', 'MKD', 'MDG', 'MWI', 'MYS',
       'MDV', 'MLI', 'MLT', 'MHL', 'MRT', 'MUS', 'MEX', 'FSM', 'MDA',
       'MCO', 'MNG', 'MAR', 'MOZ', 'NAM', 'NPL', 'NLD', 'NCL', 'NZL',
       'NIC', 'NER', 'NGA', 'NOR', 'OMN', 'PAK', 'PLW', 'PAN', 'PNG',
       'PRY', 'PER', 'PHL', 'POL', 'PRT', 'PRI', 'QAT', 'ROU', 'RUS',
       'RWA', 'WSM', 'SMR', 'SAU', 'SEN', 'SRB', 'SYC', 'SLE', 'SGP',
       'SVK', 'SVN', 'SLB', 'ZAF', 'ESP', 'LKA', 'KNA', 'LCA', 'VCT',
       'SDN', 'SUR', 'SWZ', 'SWE', 'CHE', 'SYR', 'TJK', 'TZA', 'THA',
       'TGO', 'TON', 'TTO', 'TUN', 'TUR', 'TKM', 'TUV', 'UGA', 'UKR',
       'ARE', 'URY', 'UZB', 'VUT', 'VEN', 'VNM', 'VIR', 'PSE', 'YEM',
       'ZMB', 'ZWE'], dtype=object)

In [35]:
dt2['Country Code'].unique()

array(['ARB', 'CEB', 'EAR', 'EAS', 'EAP', 'TEA', 'EMU', 'ECS', 'ECA',
       'TEC', 'EUU', 'HIC', 'IBD', 'IBT', 'IDB', 'IDX', 'IDA', 'LTE',
       'LCN', 'LAC', 'TLA', 'LMY', 'LMC', 'MEA', 'MNA', 'TMN', 'MIC',
       'NAC', 'OED', 'PST', 'PRE', 'SAS', 'TSA', 'SSF', 'SSA', 'TSS',
       'UMC', 'WLD', 'AUS', 'BRA', 'CAN', 'CHN', 'FRA', 'DEU', 'IND',
       'ITA', 'JPN', 'KOR', 'MEX', 'RUS', 'ESP', 'GBR', 'USA'],
      dtype=object)

In [43]:
code = (set(dt1['Country Code'].unique()) & set(dt2['Country Code'].unique()))
len(code)

28

# 3번
데이터에서 결측치가 가장 많은 컬럼을 출력하라

In [44]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

In [46]:
df.isnull().sum().max()

69

In [47]:
df.isnull().sum()

PassengerId     0
Survived        0
Pclass         55
Name           61
Sex            64
Age            44
SibSp          55
Parch          53
Ticket         34
Fare           69
Cabin          58
Embarked       49
dtype: int64

In [48]:
print('Fare')

Fare